let pdfMake = require('pdfmake/build/pdfmake.js');
let pdfFonts = require('pdfmake/build/vfs_fonts.js');
pdfMake.vfs = pdfFonts.pdfMake.vfs;

let dd = {
    pageMargins: [ 40, 10, 30, 0 ],
    content: [
        {
            text: 'ДОГОВІР №',
            style: 'header',
            alignment: 'center',
            fontSize: 12
        },
        {
            text: 'ПРО НАДАННЯ ІНФОРМАЦІЙНО-КОНСУЛЬТАЦІЙНИХ ПОСЛУГ.\n',
            alignment: 'center',
            fontSize: 10
        },
        {
            columns:
                [
                    {
                        width: '20%',
                        text: 'м. Львів',
                    },
                    {
                        width: '60%',
                        text: '« ___ » _________ 2019 р.',
                        alignment: 'right'
                    }
                ],
            fontSize: 10,
            margin: 15
        },

        {
            text: [
                {text: 'ФОП Онішко Андрій Броніславович', bold: true}, ', що діє на підставі рішення № 2 415 000 0000 075926 про державну реєстрацію\n',
                'СГД - фізичної особи від 18.8.2016 р. (надалі - Виконавець), з однієї сторони, та фізична особа\n',
                '________________________________________________________________________________________________________________________\n',
                '(надалі - Замовник), з іншої сторони, а разом – Сторони, уклали цей Договір про наступне:\n\n'
            ],
            fontSize: 9
        },
        {
            text: [
                {text: '1. ПРЕДМЕТ ДОГОВОРУ\n', alignment: 'center'}, '1.1.Виконавець зобов`язується надати Замовнику інформаційно-консультативні послуги за програмою курсу\n',
                '“ _______________________ ”, зміст якого Замовнику відомий до підписання даного Договору, і з яким Замовник\n',
            ],
            style: 'main'

        },
        {
            text: 'погоджується, а Замовник зобов’язується прийняти ці послуги і оплатити їх.',
            fontSize: 9,
            style: 'second'
        },
        {
            text:
                [
                    {text: '2. ПРАВА ТА ОБОВ’ЯЗКИ СТОРІН\n', alignment: 'center'}, '2.1. Права Замовника:\n',
                    '2.1.1. Отримати інформаційно-консультативні послуги за програмою курсу “ _____________________ ” вчасно (згідно\n',
                ],
            style: 'main'
        },
        {
            style: 'second',
            text: 'погодженого графіку) і повному обсязі.'
        },
        {
            text: '2.1.2. Отримувати, за погодженням Виконавця, додаткові оплатні чи безоплатні індивідуальні консультації та \n',
            style: 'third'
        },
        {
            text: ' матеріали для підвищення успішності засвоєння курсу.',
            style: 'second'
        },
        {
            text: '2.1.3. Змінити, за погодженням Виконавця, вид отримуваних послуг (програму курсу) із зарахуванням частини коштів ',
            style: 'third'
        },
        {
            text: 'пропорційно до вартості неотримуваних первинних послуг, визначених цим Договором.',
            style: 'second'
        },
        {
            text: [
                '2.1.4. Одноразово безкоштовно повторно здати підсумкове тестування для отримання сертифікату.\n',
                '2.1.5. Стати членом Програми лояльності, яку запровадив Виконавець і отримувати всі переваги, пільги і бонуси в'
            ],
            style: 'third'
        },
        {
            text: 'рамках даного курсу згідно умов Програми лояльності.', style: 'second'
        },
        {
            text: [
                '2.2. Обов’язки Замовника:\n',
                '2.2.1. Вчасно та в повному обсязі оплачувати послуги Виконавця відповідно до вимог даного Договору.\n ',
                '2.2.2. Сумлінно виконувати обов’язки Замовника відповідно до даного Договору, дотримуватися правил поведінки,'
            ],
            style: 'third'
        },
        {
            text: ' вимог техніки безпеки, вимог протипожежної і санітарної безпеки в приміщеннях Виконавця, визначеного графіку програми курсу.',
            style: 'second'
        },
        {
            text: '2.2.3. Не публікувати, не передавати третім особам та не використовувати з комерційною метою матеріали, які',
            style: 'third'
        },
        {
            text: 'надаються Виконавцем, у тому числі для самостійної роботи, без письмового дозволу Виконавця.',
            style: 'second'
        },
        {
            text: '2.2.4. Під час отримання послуг не використовувати обладнання та майно Виконавця для заподіяння шкоди третім',
            style: 'third'
        },
        {
            text: [
                'особам, несанкціонованої розсилки інформації (spam), не здійснювати неавторизований доступ до комп\'ютерних систем,\n',
                'програмного забезпечення, даних та інших матеріалів, що захищені правом інтелектуальної власності, копіювати та\n',
                'поширювати їх, виконувати інші протиправні дії, використовуючи майно Виконавця.'
            ],
            style: 'second'
        },
        {
            text: '2.2.5. В повному обсязі виконувати план курсу та передбачені ним завдання для самостійного опрацювання, вказівки',
            style: 'third'
        },
        {
            text: 'Виконавця та/або його помічників.', style: 'second'
        },
        {
            text: '2.2.6. У разі наявності хвороби або іншого стану замовника (наркотичного сп’яніння і т.п.), який може стати загрозою',
            style: 'third'
        },
        {
            text: 'здоров’ю оточуючих, не відвідувати заняття до повного одужання.', style: 'second'
        },
        {
            text: '2.2.7. У разі неявки на перше заняття, попередити Виконавця шляхом відправки електронного листа не пізніше ніж за',
            style: 'third'
        },
        {
            text: '24 години до початку заняття.',
            style: 'second'
        },
        {
            text: [
                '2.3. Права Виконавця:\n',
                '2.3.1. Призупинити/припинити надання Замовнику послуг в односторонньому порядку, у разі:\n',
                '- якщо Замовник, використовуючи обладнання Виконавця, вчинив дії, які перешкоджають функціонуванню мережі'
            ],
            style: 'third'
        },
        {
            text: [
                'Інтернет або внутрішніх каналів зв\'язку в приміщеннях (в тому числі дії незаконного або аморального характеру, або такі,\n',
                'що порушують громадський порядок, посягають на честь і гідність громадян та підприємств та/або викликають їхні\n',
                'скарги, розповсюдження в мережі вірусів або інших деструктивних компонентів, спрямовані на протиправне отримання\n',
                'конфіденційної інформації або інформації із спеціальним доступом); '
            ],
            style: 'second'
        },
        {
            text: '- недбайливого ставлення Замовника до майна та/або обладнання Виконавця, що спричинило його пошкодження - до',
            style: 'third'
        },
        {
            text: 'моменту відшкодування заподіяної шкоди;', style: 'second'
        },
        {
            text: [
                '- якщо він перебуває у стані сп’яніння, веде себе зухвало і порушує громадський порядок;\n',
                '- порушення Замовником термінів оплати послуг за даним Договором.\n',
                '- крадіжки майна виконавця.\n',
                '-  першої вимоги виконавця.'
            ],
            style: 'third'
        },
        {
            text: [
                '2.3.2. Вимагати від Замовника відшкодування в повному обсязі збитків, спричинених діями Замовника.\n',
                '2.3.3. Вносити в односторонньому порядку зміни в графік надання послуг, заздалегідь повідомивши Замовника,\n',
            ],
            style: 'main'
        },
        {
            text: ' не менш, ніж за 5 год.', style: 'second'
        },
        {
            text: [
                '2.3.4. Залучати до виконання своїх зобов’язань за даним Договором третіх осіб, що мають відповідну  кваліфікацію.\n',
                '2.3.5. Використовувати відгуки замовника у соціальних мережах та на власному сайті без додаткового повідомлення.\n',
                '2.3.6. Використовувати контактні дані замовника для відправки йому рекламних повідомлень і припинити розсилку'
            ],
            style: 'third'
        },
        {
            text: 'за першою вимогою замовника.', style: 'second'
        },
        {
            text: [
                '2.4. Обов’язки Виконавця: \n',
                '2.4.1. Надавати послуги якісно, своєчасно, в повному обсязі на умовах даного Договору та після оплати обраного'
            ],
            style: 'third'
        },
        {
            text: 'Замовником курсу. ', style: 'second'
        },
        {
            text: '2.4.2. До початку надання послуг ознайомити Замовника з приміщеннями, де надаватимуться послуги, та провести',
            style: 'third'
        },
        {
            text: 'інструктаж щодо правил поведінки та вимог техніки безпеки, вимог протипожежної і санітарної безпеки. ',
            style: 'second'
        },
        {
            text: '2.4.3. Забезпечити Замовника необхідною матеріально-технічною базою та методичними матеріалами згідно з',
            style: 'third'
        },
        {
            text: 'вимогами курсу.', style: 'second'
        },
        {
            text: '2.5. Замовник дає згоду на використання фото та відео матеріалів зроблених Виконавцем з участю Замовника в',
            style: 'third'
        },
        {
            text: 'соціальних мережах, рекламних компаніях та сайтах.', style: 'second'
        },
        {
            text: '3. ВАРТІСТЬ ПОСЛУГ ТА ПОРЯДОК РОЗРАХУНКІВ ',
            alignment: 'center',
            fontSize: 9,
            // margin: [0, -6, 0]
        },
        {
            text: '3.1. Вартість інформаційно-консультативних послуг, що надаються Виконавцем, становить ',
            style: 'main'
        },
        {
            text: '_________________________________________________--грн. 0 коп. (          грн. 0 коп.).',
            style: 'main',
            bold: true
        },
    ],
    styles: {
        header: {
            bold: true
        },
        main: {
            margin: [10, 0, 0, 0],
            fontSize: 9
        },
        second: {
            margin: [-8, 2, 0, 10],
            fontSize: 9
        },
        third: {
            margin: [10, -8, 0, 0],
            fontSize: 9
        }

    }
};


module.exports = pdfMake.createPdf(dd);
