let pdfMake = require('pdfmake/build/pdfmake.js');
let pdfFonts = require('pdfmake/build/vfs_fonts.js');
pdfMake.vfs = pdfFonts.pdfMake.vfs;

var dd = {
    pageMargins: [ 40, 10, 30, 0 ],
    content: [
        {
            text: 'ДОГОВІР №',
            style: 'header',
            alignment: 'center',
            fontSize: 12
        },
        {
            text: 'ПРО НАДАННЯ ІНФОРМАЦІЙНО-КОНСУЛЬТАЦІЙНИХ ПОСЛУГ.\n',
            alignment: 'center',
            fontSize: 10
        },
        {
            columns:
                [
                    {
                        width: '20%',
                        text: 'м. Львів',
                    },
                    {
                        width: '60%',
                        text: '« ___ » _________ 2019 р.',
                        alignment: 'right'
                    }
                ],
            fontSize: 10,
            margin: 15
        },

        {
            text: [
                {text: 'ФОП Онішко Андрій Броніславович', bold: true}, ', що діє на підставі рішення № 2 415 000 0000 075926 про державну реєстрацію\n',
                'СГД - фізичної особи від 18.8.2016 р. (надалі - Виконавець), з однієї сторони, та фізична особа\n',
                '________________________________________________________________________________________________________________________\n',
                '(надалі - Замовник), з іншої сторони, а разом – Сторони, уклали цей Договір про наступне:\n\n'
            ],
            fontSize: 9
        },
        {
            text: [
                {text: '1. ПРЕДМЕТ ДОГОВОРУ\n', alignment: 'center'}, '1.1.Виконавець зобов`язується надати Замовнику інформаційно-консультативні послуги за програмою курсу\n',
                '“ _______________________ ”, зміст якого Замовнику відомий до підписання даного Договору, і з яким Замовник\n',
            ],
            style: 'main'

        },
        {
            text: 'погоджується, а Замовник зобов’язується прийняти ці послуги і оплатити їх.',
            fontSize: 9,
            style: 'second'
        },
        {
            text:
                [
                    {text: '2. ПРАВА ТА ОБОВ’ЯЗКИ СТОРІН\n', alignment: 'center'}, '2.1. Права Замовника:\n',
                    '2.1.1. Отримати інформаційно-консультативні послуги за програмою курсу “ _____________________ ” вчасно (згідно\n',
                ],
            style: 'main'
        },
        {
            style: 'second',
            text: 'погодженого графіку) і повному обсязі.'
        },
        {
            text: '2.1.2. Отримувати, за погодженням Виконавця, додаткові оплатні чи безоплатні індивідуальні консультації та \n',
            style: 'third'
        },
        {
            text: ' матеріали для підвищення успішності засвоєння курсу.',
            style: 'second'
        },
        {
            text: '2.1.3. Змінити, за погодженням Виконавця, вид отримуваних послуг (програму курсу) із зарахуванням частини коштів ',
            style: 'third'
        },
        {
            text: 'пропорційно до вартості неотримуваних первинних послуг, визначених цим Договором.',
            style: 'second'
        },
        {
            text: [
                '2.1.4. Одноразово безкоштовно повторно здати підсумкове тестування для отримання сертифікату.\n',
                '2.1.5. Стати членом Програми лояльності, яку запровадив Виконавець і отримувати всі переваги, пільги і бонуси в'
            ],
            style: 'third'
        },
        {
            text: 'рамках даного курсу згідно умов Програми лояльності.', style: 'second'
        },
        {
            text: [
                '2.2. Обов’язки Замовника:\n',
                '2.2.1. Вчасно та в повному обсязі оплачувати послуги Виконавця відповідно до вимог даного Договору.\n ',
                '2.2.2. Сумлінно виконувати обов’язки Замовника відповідно до даного Договору, дотримуватися правил поведінки,'
            ],
            style: 'third'
        },
        {
            text: ' вимог техніки безпеки, вимог протипожежної і санітарної безпеки в приміщеннях Виконавця, визначеного графіку програми курсу.',
            style: 'second'
        },
        {
            text: '2.2.3. Не публікувати, не передавати третім особам та не використовувати з комерційною метою матеріали, які',
            style: 'third'
        },
        {
            text: 'надаються Виконавцем, у тому числі для самостійної роботи, без письмового дозволу Виконавця.',
            style: 'second'
        },
        {
            text: '2.2.4. Під час отримання послуг не використовувати обладнання та майно Виконавця для заподіяння шкоди третім',
            style: 'third'
        },
        {
            text: [
                'особам, несанкціонованої розсилки інформації (spam), не здійснювати неавторизований доступ до комп\'ютерних систем,\n',
                'програмного забезпечення, даних та інших матеріалів, що захищені правом інтелектуальної власності, копіювати та\n',
                'поширювати їх, виконувати інші протиправні дії, використовуючи майно Виконавця.'
            ],
            style: 'second'
        },
        {
            text: '2.2.5. В повному обсязі виконувати план курсу та передбачені ним завдання для самостійного опрацювання, вказівки',
            style: 'third'
        },
        {
            text: 'Виконавця та/або його помічників.', style: 'second'
        },
        {
            text: '2.2.6. У разі наявності хвороби або іншого стану замовника (наркотичного сп’яніння і т.п.), який може стати загрозою',
            style: 'third'
        },
        {
            text: 'здоров’ю оточуючих, не відвідувати заняття до повного одужання.', style: 'second'
        },
        {
            text: '2.2.7. У разі неявки на перше заняття, попередити Виконавця шляхом відправки електронного листа не пізніше ніж за',
            style: 'third'
        },
        {
            text: '24 години до початку заняття.',
            style: 'second'
        },
        {
            text: [
                '2.3. Права Виконавця:\n',
                '2.3.1. Призупинити/припинити надання Замовнику послуг в односторонньому порядку, у разі:\n',
                '- якщо Замовник, використовуючи обладнання Виконавця, вчинив дії, які перешкоджають функціонуванню мережі'
            ],
            style: 'third'
        },
        {
            text: [
                'Інтернет або внутрішніх каналів зв\'язку в приміщеннях (в тому числі дії незаконного або аморального характеру, або такі,\n',
                'що порушують громадський порядок, посягають на честь і гідність громадян та підприємств та/або викликають їхні\n',
                'скарги, розповсюдження в мережі вірусів або інших деструктивних компонентів, спрямовані на протиправне отримання\n',
                'конфіденційної інформації або інформації із спеціальним доступом); '
            ],
            style: 'second'
        },
        {
            text: '- недбайливого ставлення Замовника до майна та/або обладнання Виконавця, що спричинило його пошкодження - до',
            style: 'third'
        },
        {
            text: 'моменту відшкодування заподіяної шкоди;', style: 'second'
        },
        {
            text: [
                '- якщо він перебуває у стані сп’яніння, веде себе зухвало і порушує громадський порядок;\n',
                '- порушення Замовником термінів оплати послуг за даним Договором.\n',
                '- крадіжки майна виконавця.\n',
                '-  першої вимоги виконавця.'
            ],
            style: 'third'
        },
        {
            text: [
                '2.3.2. Вимагати від Замовника відшкодування в повному обсязі збитків, спричинених діями Замовника.\n',
                '2.3.3. Вносити в односторонньому порядку зміни в графік надання послуг, заздалегідь повідомивши Замовника,\n',
            ],
            style: 'main'
        },
        {
            text: ' не менш, ніж за 5 год.', style: 'second'
        },
        {
            text: [
                '2.3.4. Залучати до виконання своїх зобов’язань за даним Договором третіх осіб, що мають відповідну  кваліфікацію.\n',
                '2.3.5. Використовувати відгуки замовника у соціальних мережах та на власному сайті без додаткового повідомлення.\n',
                '2.3.6. Використовувати контактні дані замовника для відправки йому рекламних повідомлень і припинити розсилку'
            ],
            style: 'third'
        },
        {
            text: 'за першою вимогою замовника.', style: 'second'
        },
        {
            text: [
                '2.4. Обов’язки Виконавця: \n',
                '2.4.1. Надавати послуги якісно, своєчасно, в повному обсязі на умовах даного Договору та після оплати обраного'
            ],
            style: 'third'
        },
        {
            text: 'Замовником курсу. ', style: 'second'
        },
        {
            text: '2.4.2. До початку надання послуг ознайомити Замовника з приміщеннями, де надаватимуться послуги, та провести',
            style: 'third'
        },
        {
            text: 'інструктаж щодо правил поведінки та вимог техніки безпеки, вимог протипожежної і санітарної безпеки. ',
            style: 'second'
        },
        {
            text: '2.4.3. Забезпечити Замовника необхідною матеріально-технічною базою та методичними матеріалами згідно з',
            style: 'third'
        },
        {
            text: 'вимогами курсу.', style: 'second'
        },
        {
            text: '2.5. Замовник дає згоду на використання фото та відео матеріалів зроблених Виконавцем з участю Замовника в',
            style: 'third'
        },
        {
            text: 'соціальних мережах, рекламних компаніях та сайтах.', style: 'second'
        },
        {
            text: '3. ВАРТІСТЬ ПОСЛУГ ТА ПОРЯДОК РОЗРАХУНКІВ ',
            alignment: 'center',
            fontSize: 9,
            // margin: [0, -6, 0]
        },
        {
            text: '3.1. Вартість інформаційно-консультативних послуг, що надаються Виконавцем, становить ',
            style: 'main'
        },
        {
            text: '_________________________________________________--грн. 0 коп. (          грн. 0 коп.).',
            style: 'main',
            bold: true
        },
        {
            text: '3.2. Послуги за цим Договором оплачуються шляхом 100% передоплати їх вартості на рахунок Виконавця, що',
            style: 'main'
        },
        {
            text: 'підтверджується складанням Актом приймання-передачі, підписаним Сторонами. ',
            style: 'second'
        },
        {
            text: '3.3. Замовник має право на повернення сплачених за курс коштів після відвідання першого зайняття тільки у випадку',
            style: 'third'
        },
        {
            text: [
                'попередження Виконавця електронним листом за електронною адресою ​info@owu.com.ua за термін не пізніше 1 години\n',
                'після завершення першого заняття. Замовник погоджується, що повернення коштів відбувається протягом одного місяця з\n',
                'моменту звернення до Виконавця. ',
                {text: 'В інших, ніж ті, що передбачені цим пунктом Договору випадках, сплачена Замовником\n',
                    bold: true
                },
                {text: 'за цим Договором сума передоплати поверненню не підлягає. \n',
                    bold: true
                }
            ],
            style: 'second'
        },
        {
            text: '3.4​ . ​Замовник зобов’язаний оплатити Виконавцеві вартість послуг в розмірі та на умовах передбачених пп.3.1.,\n',
            style: 'third', bold: true,
        },
        {
            text: [
                '3.2. цього Договору незалежно від тривалості навчання на курсі, обсягу виконаних завдань, кількості прослуханих\n',
                'занять, інших обставин, за винятком випадків, визначених п. 3.3. цього Договору.'
            ],
            style: 'second', bold: true
        },
        {
            text: '3.5. В разі, якщо Замовник прослухав перше зайняття, Сторони погоджують, що Замовника задовольняє якість надання',
            style: 'third'
        },
        {
            text: [
                'інформаційно-консультаційних послуг та порядок їх надання. В такому випадку Замовник не має права вимагати від\n',
                'Виконавця повернення сплачених згідно п. 3.1. даного Договору коштів.'
            ],
            style: 'second'
        },
        {
            text: '3.6. Замовник має право одноразово призупинити отримання послуг на строк обумовлений Сторонами. В такому',
            style: 'third'
        },
        {
            text: 'випадку поновлення надання послуг може розпочатися згідно графіку, якій узгоджується Виконавцем.',
            style: 'second'
        },
        {
            text: [
                '3.7. Підписання акту виконаних робіт засвідчує, що виконавець надав послуги в повному обсязі.\n',
                '3.8. У випадку пропуску Замовником занять чи невиконання завдань сплачені кошти за ці заняття поверненню не'
            ],
            style: 'third'
        },
        {
            text: 'підлягають.',
            style: 'second'
        },
        {
            text: '3.9. Сторони доходять згоди, що у випадку надання Змаовнику розтермінування, сплата за отримання послуг',
            style: 'third'
        },
        {
            text: 'відбувається наступним чином: ',
            style: 'second'
        },
        {
            text: [
                '- 50% вартості послуг сплачуються не пізніше ніж  _______________20__р.\n',
                '- 50% вартості послуг сплачуються не пізніше ніж 21 календарний день від ______________20__р.'
            ],
            margin: [20, -8, 0, 0],
            fontSize: 9
        },
        {
            text: '4. ПОРЯДОК ОТРИМАННЯ СЕРТИФІКАТУ',
            alignment: 'center',
            margin: [0, 8, 0, 0],
            style: 'main'
        },
        {
            text: '4.1. Замовник має право отримати іменний сертифікат про успішне засвоєння курсу згідно вимог програмного плану в',
            style: 'main'
        },
        {
            text: 'разі дотримання наступних умов: ',
            style: 'second'
        },
        {
            text: [
                '- Замовник був присутній не менше, аніж на 80% занять;\n ',
                '- Виконавець прийняв від Замовника позитивне виконання не менше 80% завдань для самостійного опрацювання '
            ],
            style: 'third'
        },
        {
            text: 'матеріалу (домашня робота); ',
            style: 'second'
        },
        {
            text: '- Виконавець прийняв від Замовника позитивне виконання не менше 80% підсумкового тестування, яке має на меті',
            style: 'third'
        },
        {
            text: 'перевірку засвоєння програмного матеріалу Замовником. ',
            style: 'second'
        },
        {
            text: '4.2. В разі, якщо Замовник не набере 80% балів і Виконавець не прийме від Замовника позитивне виконання',
            style: 'third'
        },
        {
            text: [
                'підсумкового тестування, Замовник має право одноразово, в узгоджений із Виконавцем час і день, протягом одного місяця',
                ' безкоштовно пройти підсумкове тестування для отримання сертифікату.'
            ],
            style: 'second'
        },
        {
            text: '4.3. Кількість додаткових здач підсумкового тестування не є обмеженою, але наступні перездачі є платними. Сума',
            style: 'third'
        },
        {
            text: [
                'оплати такої перездачі погоджується з Виконавцем. Для підготовки перездачі рекомендується проведення додаткових\n',
                'індивідуальних занять по матеріалу, щодо якого виникало найбільше помилок. '
            ],
            style: 'second'
        },
        {
            text: '5. КОНФІДЕНЦІЙНІСТЬ ',
            style: 'third',
            bold: true,
            alignment: 'center'
        },
        {
            text: '5.1. ​Відеоматеріали та завдання отримані Замовником від Виконавця під час дії цього Договору, незалежно від',
            style: 'main',
            bold: true
        },
        {
            text: 'її змісту та форми зовнішнього вираження є конфіденційною інформацією Виконавця.',
            style: 'second',
            bold: true
        },
        {
            text: '5.2. Замовник зобов’язаний зберігати в таємниці конфіденційну інформацію Виконавця та не вправі:',
            style: 'third',
            bold: true
        },
        {
            text: [
                'розголошувати, передавати, робити конфіденційну інформацію доступною для третіх осіб, здійснювати обробку такої\n',
                'інформації всупереч умовам цього Договору, її цільового призначення, меті для якої така інформація доведена до\n',
                'відома Замовника без попередньої на те письмової згоди Виконавця, крім випадків, коли обов’язок з передачі\n',
                'Замовником такої інформації третім особам, зміст та обсяг інформації, що підлягає передачі прямо передбачені\n',
                'чинним законодавством України. '
            ],
            style: 'second',
            bold: true
        },
        {
            text: '6. ВІДПОВІДАЛЬНІСТЬ СТОРІН ',
            style: 'third',
            bold: true,
            alignment: 'center'
        },
        {
            text: '6.1. За порушення взятих на себе за цим Договором Сторони несуть відповідальність в порядку та на підставах',
            style: 'main',
            bold: true
        },
        {
            text: 'передбачених цим Договором та чинним законодавством України. ',
            style: 'second',
            bold: true
        },
        {
            text: '6.2. За порушення Замовником вимог, передбачених пп. 5.1., 5.2 цього Договору, останній сплачує на користь',
            style: 'third',
            bold: true
        },
        {
            text: 'Виконавця штраф у сумі 150 000, 00 грн. за кожен випадок такого порушення.',
            style: 'second',
            bold: true
        },
        {
            text: '7. СТРОК ДІЇ ДОГОВОРУ ТА ІНШІ УМОВИ ',
            style: 'main',
            alignment: 'center'
        },
        {
            text: '7.1. Даний Договір набуває чинності з моменту здійснення Замовником оплати послуг Виконавцю та діє до повного ',
            style: 'main'
        },
        {
            text: 'виконання Сторонами своїх зобов`язань за Договором. ',
            style: 'second'
        },
        {
            text: '7.2. Даний Договір може бути розірваним Виконавцем в односторонньому порядку у випадку, передбаченому п. 2.3.1.',
            style: 'third'
        },
        {
            text: 'цього Договору. ',
            style: 'second'
        },
        {
            text: '7.3. Даний Договір може бути розірвано на вимогу Замовника у будь-який час за наявності його письмової заяви з',
            style: 'third'
        },
        {
            text: 'дотриманням вимог п. 3.3. цього Договору. ',
            style: 'second'
        },
        {
            text: '7.4. Сторони погоджуються вирішувати всі питання між собою шляхом переговорів з метою досягнення взаємної',
            style: 'third'
        },
        {
            text: [
                'користі Сторін, проте це не позбавляє їх права звернутися за захистом своїх прав і законних інтересів в суд в порядку,',
                ' визначеному чинним законодавством. '
            ],
            style: 'second'
        },
        {
            text: '  7.5. Будь-які зміни, доповнення та додатки до даного Договору набирають сили виключно після погодження Сторонами ',
            style: 'third'
        },
        {
            text: 'або їх представниками і підписання відповідних письмових примірників. ',
            style: 'second'
        },
        {
            text: ' 7.6. Даний Договір складено українською мовою у двох примірниках, які мають однакову юридичну силу для кожної із ',
            style: 'third',
            margin: [10, 5, 0, 0]
        },
        {
            text: 'Сторін. ',
            style: 'second'
        },
        {
            text: 'РЕКВІЗИТИ СТОРІН ',
            alignment: 'center',
            fontSize: 9
        },
        {
            style: 'tableExample',
            table: {
                widths: [230, 260],
                headerRows: 1,
                body: [
                    [{text: 'ВИКОНАВЕЦЬ', style: 'tableHeader'}, {text: 'ЗАМОВНИК ', style: 'tableHeader'},],
                    [
                        {
                            text: [
                                {text: 'ФОП Онішко А.Б.\n', style: 'tableContent'},
                                {text: '79005 м. Львів, вул. Романчука, 15/10\n', style: 'tableContent'},
                                {text: 'Банк: АТ «ОТП банк» м. Київ,\n',style: 'tableContent'},
                                {text: 'МФО 300528, п/р 26004455025762\n', style: 'tableContent'},
                                {text: 'ІПН 2965618354, тел.: 050 155 39 35\n\n\n', style: 'tableContent'},
                                {text: '__________________    ______________  2019 \n', fontSize: 9},
                                {text: '  /Онішко А.Б./ ', fontSize: 9}
                            ],
                        },
                        {
                            text: [
                                {text: 'ПІБ:  ___________________________\n\n', fontSize: 9},
                                {text: 'Адреса: ________________________ \n\n', fontSize: 9},
                                {text: 'Тел.: ___________________________\n\n', fontSize: 9},
                                {text: '/______________________/', alignment: 'center', fontSize: 9},
                            ]
                        }
                    ]
                ]
            }
        },

    ],
    styles: {
        header: {
            bold: true
        },
        tableHeader: {
            alignment: 'center',
            fontSize: 10,
            margin: [0, 3, 0, 3]
        },
        tableContent: {
            alignment: 'center',
            fontSize: 9
        },
        main: {
            margin: [10, 0, 0, 0],
            fontSize: 9
        },
        second: {
            margin: [-8, 2, 0, 10],
            fontSize: 9
        },
        third: {
            margin: [10, -8, 0, 0],
            fontSize: 9
        }

    }
};


module.exports = pdfMake.createPdf(dd);
